// Напишите программу, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя).
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
int result = number * number;
Console.Write("Квадрат числа: " + result);
